&НаКлиенте
Процедура ОтправитьНаАнализ(Команда)
    // Проверка заполнения пути
    Если ПустаяСтрока(СокрЛП(ПутьКФайлу)) Тогда
        Сообщить("Ошибка: не указан путь к ZIP‑файлу!");
        Возврат;
    КонецЕсли;


    // Проверка существования файла — вызываем серверную функцию
    ФайлНайден = ПроверитьСуществованиеФайлаНаСервере(ПутьКФайлу);
    Если НЕ ФайлНайден Тогда
        Сообщить("Ошибка: файл не найден по указанному пути!");
        Возврат;
    КонецЕсли;

    Попытка
        // Чтение файла в двоичные данные
        ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);

        // Отправка на сервер Flask
        РезультатАнализа = ОтправитьZIPНаАнализ(ДвоичныеДанныеФайла);


//        // Отображение результата
//        ОтобразитьРезультат(РезультатАнализа);
    Исключение
        Сообщить("Ошибка при обработке: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры


&НаСервере
Функция ПроверитьСуществованиеФайлаНаСервере(ПолныйПутьКФайлу)
    Попытка
        Файл = Новый Файл(ПолныйПутьКФайлу);
        Возврат Файл.Существует();
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции

&НаСервере
Функция ОтправитьZIPНаАнализ(ДвоичныеДанныеФайла)
    HTTPСоединение = Новый HTTPСоединение("localhost", 5000);
    HTTPЗапрос = Новый HTTPЗапрос("/api/analyze");

    HTTPЗапрос.Метод = "POST";
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/zip");
    HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанныеФайла);

    Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

    Если Ответ.КодСостояния = 200 Тогда
        Возврат Ответ.ПолучитьТелоКакСтроку();
    Иначе
        ВызватьИсключение "Ошибка сервера: код " + Ответ.КодСостояния;
    КонецЕсли;
КонецФункции

//&НаКлиенте
//Процедура ОтобразитьРезультат(JSONСтрока)
//    ОтформатированныйJSON = ОтформатироватьJSON(JSONСтрока);
//    РезультатАнализа = "<html><body><pre style='font-family: monospace; font-size: 12px;'>" +
//                  ОтформатированныйJSON + "</pre></body></html>";
//КонецПроцедуры


//&НаКлиенте
//Функция ОтформатироватьJSON(JSONСтрока) Экспорт
//    Попытка
//        СтруктураJSON = ЗначениеИзJSON(JSONСтрока);
//        Возврат JSONВСтроку(СтруктураJSON, Истина);
//    Исключение
//        Возврат JSONСтрока;
//    КонецПопытки;
//КонецФункции

//&НаКлиенте
//Функция JSONВСтроку(Значение, Форматировать = Ложь) Экспорт
//    Поток = Новый ПотокВПамяти();
//    ЗаписьJSON = Новый ЗаписьJSON(Поток);
//    ЗаписьJSON.Записать(Значение);
//    ЗаписьJSON.Закрыть();

//    СтрокаJSON = Поток.ПолучитьТекст();

//    Если Форматировать Тогда
//        СтрокаJSON = Заменить(СтрокаJSON, "{", "{\n  ");
//        СтрокаJSON = Заменить(СтрокаJSON, "}", "\n}");
//        СтрокаJSON = Заменить(СтрокаJSON, ",", ",\n  ");
//    КонецЕсли;

//    Возврат СтрокаJSON;
//КонецФункции
